# Section 1: Data Pipelines

The objective of this Notebook is to process data files by:
- Split the name field into first_name, and last_name;
- Remove any zeros prepended to the price field;
- Delete any rows which do not have a name;
- Create a new field named above_100, which is true if the price is strictly greater than 100

In [1]:
# import libraries
import pandas as pd
import numpy as np
import sqlite3

In [37]:
# load messages dataset
dataset1 =  pd.read_csv('dataset1.csv')

# clean data
dataset1['name'] = dataset1['name'].str.strip()
dataset1['name'].replace('', np.nan, inplace=True)
dataset1['price'] = pd.to_numeric(dataset1['price'],errors='coerce')
# remove rows with empty name or non-numeric price
dataset1.dropna(subset=['name'], inplace=True)
dataset1.dropna(subset=['price'], inplace=True)

# Split the name field into first_name and last_name
dataset1[['first_name','last_name']] = dataset1['name'].loc[dataset1['name'].str.split().str.len() == 2].str.split(expand=True)
# Create a new field named above_100
dataset1['above_100'] = np.where(dataset1['price']>100, True, False)

dataset1.head()

             name       price first_name last_name  above_100
0   William Dixon  109.037280    William     Dixon       True
1    Kristen Horn  262.524652    Kristen      Horn       True
2  Kimberly Chang  187.007258   Kimberly     Chang       True
3       Mary Ball  283.174648       Mary      Ball       True
4  Benjamin Craig  143.871582   Benjamin     Craig       True

In [33]:
# load messages dataset
dataset2 =  pd.read_csv('dataset2.csv')

# clean data
dataset2['name'] = dataset2['name'].str.strip()
dataset2['name'].replace('', np.nan, inplace=True)
dataset2['price'] = pd.to_numeric(dataset2['price'],errors='coerce')
# remove rows with empty name or non-numeric price
dataset2.dropna(subset=['name'], inplace=True)
dataset2.dropna(subset=['price'], inplace=True)

# Split the name field into first_name and last_name
dataset2[['first_name','last_name']] = dataset2['name'].loc[dataset2['name'].str.split().str.len() == 2].str.split(expand=True)
# Create a new field named above_100
dataset2['above_100'] = np.where(dataset2['price']>100, True, False)

dataset2.head()

                 name       price first_name  last_name  above_100
1     Barbara Freeman  141.890534    Barbara    Freeman       True
2   Rebecca Zimmerman  293.373272    Rebecca  Zimmerman       True
3  Patricia Velasquez  249.947925   Patricia  Velasquez       True
4        Ronnie Clark  272.908659     Ronnie      Clark       True
5        Timothy Rose   65.743270    Timothy       Rose      False

In [39]:
# export processed csv
dataset1.to_csv('dataset1_processed.csv',index=False)
dataset2.to_csv('dataset2_processed.csv',index=False)